# !/usr/bin/env python
# -*- encoding:utf-8 -*-
# __author__ = "Xeon"
# Email: Xeon@xeon.org.cn
""""""


'''
书写格式

格式：\033[显示方式;前景色;背景色m

说明：
前景色            背景色           颜色
---------------------------------------
30                40              黑色
31                41              红色
32                42              绿色
33                43              黃色
34                44              蓝色
35                45              紫红色
36                46              青蓝色
37                47              白色

显示方式           意义
-------------------------
0                终端默认设置
1                高亮显示
4                使用下划线
5                闪烁
7                反白显示
8                不可见
'''

# 例子：
# \033[1;31;40m    <!--1-高亮显示 31-前景色红色  40-背景色黑色-->
# \033[0m          <!--采用终端默认设置，即取消颜色设置-->

'''
举例
'''

# print('\033[1;31;40m')
# print('*' * 50)
# print('*HOST:\t', 2002)
# print('*URI:\t', 'http://127.0.0.1')
# print('*ARGS:\t', 111)
# print('*TIME:\t', '22:28')
# print('*' * 50)
# print('\033[0m')


# print('张志强'.center(30,'-'))

print("\033[31;1m你好麽，\033[0m我很好。。")  # 红色
print("\033[32;1m你好麽，\033[0m我很好。。")  # 绿色
print("\033[33;1m你好麽，\033[0m我很好。。")  # 黄色
print("\033[34;1m你好麽，\033[0m我很好。。")  # 蓝色
print("\033[35;1m你好麽，\033[0m我很好。。")  # 粉色
print("\033[36;1m你好麽，\033[0m我很好。。")  # 青色
print("\033[37;1m你好麽，\033[0m我很好。。")  # 灰色

#背景色
print("\033[0;41;1m你好麽，\033[0m我很好。。")
print("\033[1;42;1m你好麽，\033[0m我很好。。")
print("\033[4;43;1m你好麽，\033[0m我很好。。")
print("\033[5;44;1m你好麽，\033[0m我很好。。")
print("\033[7;45;1m你好麽，\033[0m我很好。。")
print("\033[8;46;1m你好麽，\033[0m我很好。。")
print("\033[47;1m你好麽，\033[0m我很好。。")